Autodesk.Revit.DB.RevitLinkGraphicsSettings.SetDiscipline(Autodesk.Revit.DB.LinkVisibility,Autodesk.Revit.DB.ViewDiscipline)
Sets discipline and discipline type of RevitLinkGraphicsSettings.
disciplineType:
The type of the discipline.
discipline:
The discipline.
If disciplineType is set to Autodesk.Revit.DB.LinkVisibility.ByHostView or Autodesk.Revit.DB.LinkVisibility.ByLinkView the discipline must be set to Autodesk.Revit.DB.ViewDiscipline.Architectural.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2025

Autodesk.Revit.DB.RevitLinkGraphicsSettings.GetDisciplineType
The discipline type of RevitLinkGraphicsSettings.
Since:
2025

Autodesk.Revit.DB.RevitLinkGraphicsSettings.GetDiscipline
The linked document discipline of RevitLinkGraphicsSettings.
Since:
2025

Autodesk.Revit.DB.RevitLinkGraphicsSettings.SetViewDetailLevel(Autodesk.Revit.DB.LinkVisibility,Autodesk.Revit.DB.ViewDetailLevel)
Sets view detail level and detail level type of RevitLinkGraphicsSettings.
viewDetailLevelType:
The type of the view detail level.
viewDetailLevel:
The view detail level.
If viewDetailLevelType is set to Autodesk.Revit.DB.LinkVisibility.ByHostView or Autodesk.Revit.DB.LinkVisibility.ByLinkView the viewDetailLevel must be set to Autodesk.Revit.DB.ViewDetailLevel.Undefined.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2025

Autodesk.Revit.DB.RevitLinkGraphicsSettings.GetViewDetailLevelType
The view detail level type of RevitLinkGraphicsSettings.
Since:
2025

Autodesk.Revit.DB.RevitLinkGraphicsSettings.GetViewDetailLevel
The linked document view detail level of RevitLinkGraphicsSettings.
Since:
2025

Autodesk.Revit.DB.RevitLinkGraphicsSettings.SetPhaseFilter(Autodesk.Revit.DB.LinkVisibility,Autodesk.Revit.DB.ElementId)
Sets phase filter id and phase filter type of RevitLinkGraphicsSettings.
phaseFilterType:
The type of the phase filter.
phaseFilterId:
The id of the phase filter from the linked document or Autodesk.Revit.DB.ElementId.InvalidElementId.
If phaseFilterType is set to Autodesk.Revit.DB.LinkVisibility.ByHostView or Autodesk.Revit.DB.LinkVisibility.ByLinkView the phaseFilterId must be set to Autodesk.Revit.DB.ElementId.InvalidElementId.
If phaseFilterType is set to Autodesk.Revit.DB.LinkVisibility.Custom and phaseFilterId is Autodesk.Revit.DB.ElementId.InvalidElementId the state of the phase filter will correspond to the None option in the UI.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2025

Autodesk.Revit.DB.RevitLinkGraphicsSettings.GetPhaseFilterType
The phase filter type of RevitLinkGraphicsSettings.
Since:
2025

Autodesk.Revit.DB.RevitLinkGraphicsSettings.GetPhaseFilterId
The linked document phase filter id of RevitLinkGraphicsSettings, or Autodesk.Revit.DB.ElementId.InvalidElementId if there is no phase filter explicitly assigned.
Since:
2025

Autodesk.Revit.DB.RevitLinkGraphicsSettings.SetPhase(Autodesk.Revit.DB.LinkVisibility,Autodesk.Revit.DB.ElementId)
Sets phase id and phase type of RevitLinkGraphicsSettings.
phaseType:
The type of the phase.
phaseId:
The id of the phase from the linked document or Autodesk.Revit.DB.ElementId.InvalidElementId.
If phaseType is set to Autodesk.Revit.DB.LinkVisibility.ByHostView or Autodesk.Revit.DB.LinkVisibility.ByLinkView the phaseId must be set to Autodesk.Revit.DB.ElementId.InvalidElementId.
If phaseType is set to Autodesk.Revit.DB.LinkVisibility.Custom and phaseId is Autodesk.Revit.DB.ElementId.InvalidElementId the phase will reference to the last phase from the linked document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2025

Autodesk.Revit.DB.RevitLinkGraphicsSettings.GetPhaseType
The phase type of RevitLinkGraphicsSettings.
Since:
2025

Autodesk.Revit.DB.RevitLinkGraphicsSettings.GetPhaseId
The linked document phase id of RevitLinkGraphicsSettings, or Autodesk.Revit.DB.ElementId.InvalidElementId if there is no phase explicitly assigned.
Since:
2025

Autodesk.Revit.DB.RevitLinkGraphicsSettings.IsViewRangeSupported(Autodesk.Revit.DB.View)
Returns true if the input view supports ViewRange settings of Autodesk.Revit.DB.RevitLinkGraphicsSettings, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.RevitLinkGraphicsSettings.NestedLinks
The nested links of RevitLinkGraphicsSettings.
The nested links can be set to Autodesk.Revit.DB.LinkVisibility.ByHostView or Autodesk.Revit.DB.LinkVisibility.ByLinkView.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: Disallowed LinkVisibility value.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2025

Autodesk.Revit.DB.RevitLinkGraphicsSettings.ObjectStyles
The object styles of RevitLinkGraphicsSettings.
The object styles can be set to Autodesk.Revit.DB.LinkVisibility.ByHostView or Autodesk.Revit.DB.LinkVisibility.ByLinkView.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: Disallowed LinkVisibility value.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2025

Autodesk.Revit.DB.RevitLinkGraphicsSettings.ColorFill
The color fill of RevitLinkGraphicsSettings.
The color fill can be set to Autodesk.Revit.DB.LinkVisibility.ByHostView or Autodesk.Revit.DB.LinkVisibility.ByLinkView.
Only a view that supports color fill can have this property set to Autodesk.Revit.DB.LinkVisibility.ByLinkView.
To check if the view supports the color fill use Autodesk.Revit.DB.View.SupportedColorFillCategoryIds to see if there is any supported color fill category for the view.
The Autodesk.Revit.DB.RevitLinkGraphicsSettings.LinkedViewId parameter must have a value assigned if this property is set to Autodesk.Revit.DB.LinkVisibility.ByLinkView.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: Disallowed LinkVisibility value.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2025

Autodesk.Revit.DB.RevitLinkGraphicsSettings.ViewRange
The view range of RevitLinkGraphicsSettings.
The view range can be set to Autodesk.Revit.DB.LinkVisibility.ByHostView or Autodesk.Revit.DB.LinkVisibility.ByLinkView.
Only a view that supports view range can have this property set to Autodesk.Revit.DB.LinkVisibility.ByLinkView.
To check if the view supports the view range use Autodesk::Revit::DB::LinkVisibility::IsViewRangeSupported(Autodesk::Revit::DB::LinkVisibility).
The Autodesk.Revit.DB.RevitLinkGraphicsSettings.LinkedViewId parameter must have a value assigned if this property is set to Autodesk.Revit.DB.LinkVisibility.ByLinkView.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: Disallowed LinkVisibility value.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2025

Autodesk.Revit.DB.RevitLinkGraphicsSettings.ViewFilterType
The view filter type of RevitLinkGraphicsSettings.
If the Autodesk.Revit.DB.RevitLinkGraphicsSettings.LinkVisibilityType is set to
Autodesk.Revit.DB.LinkVisibility.ByHostView, then the view filter type should be set to Autodesk.Revit.DB.LinkVisibility.ByHostView.
If the Autodesk.Revit.DB.RevitLinkGraphicsSettings.LinkVisibilityType is set to
Autodesk.Revit.DB.LinkVisibility.ByLinkView, then the view filter type should be set to Autodesk.Revit.DB.LinkVisibility.ByLinkView.
If the Autodesk.Revit.DB.RevitLinkGraphicsSettings.LinkVisibilityType is set to
Autodesk.Revit.DB.LinkVisibility.Custom, then the view filter type can be set to any value from Autodesk.Revit.DB.LinkVisibility enum.
The Autodesk.Revit.DB.RevitLinkGraphicsSettings.LinkedViewId parameter must have a value assigned if this property is set to Autodesk.Revit.DB.LinkVisibility.ByLinkView.
The Autodesk.Revit.DB.LinkVisibility.Custom value corresponds to None option in the UI.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2025